/*UNCRUSTIFY-OFF*/
/**
 * @file fs.c
 * @author Manny Peterson <manny@heliosproj.org>
 * @brief Kernel source for FAT32 filesystem support
 * @version 0.5.0
 * @date 2023-03-19
 *
 * @copyright
 * HeliOS Embedded Operating System Copyright (C) 2020-2023 HeliOS Project <license@heliosproj.org>
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 *
 */
/*UNCRUSTIFY-ON*/
#include "fs.h"


/* Forward declaration of block device command structure */
typedef struct BlockDeviceCommand_s {
  Byte_t command;
  Word_t blockNumber;
  HalfWord_t blockCount;
  Byte_t reserved;
} BlockDeviceCommand_t;


/* FAT32 Boot Sector Structure (aligned for direct memory mapping) */
typedef struct __attribute__ ((packed)) FAT32BootSector_s {
  Byte_t jumpBoot[3];               /* 0x00: Jump instruction */
  Byte_t oemName[8]; /* 0x03: OEM name */
  Byte_t bytesPerSector[2]; /* 0x0B: Bytes per sector (little-endian) */
  Byte_t sectorsPerCluster; /* 0x0D: Sectors per cluster */
  Byte_t reservedSectors[2]; /* 0x0E: Reserved sectors */
  Byte_t numFATs; /* 0x10: Number of FATs */
  Byte_t rootEntryCount[2]; /* 0x11: Root entries (0 for FAT32) */
  Byte_t totalSectors16[2]; /* 0x13: Total sectors (0 for FAT32) */
  Byte_t mediaType; /* 0x15: Media descriptor */
  Byte_t FATSize16[2]; /* 0x16: FAT size (0 for FAT32) */
  Byte_t sectorsPerTrack[2]; /* 0x18: Sectors per track */
  Byte_t numHeads[2]; /* 0x1A: Number of heads */
  Byte_t hiddenSectors[4]; /* 0x1C: Hidden sectors */
  Byte_t totalSectors32[4]; /* 0x20: Total sectors */
  Byte_t FATSize32[4]; /* 0x24: FAT size */
  Byte_t extFlags[2]; /* 0x28: Extended flags */
  Byte_t fsVersion[2]; /* 0x2A: Filesystem version */
  Byte_t rootCluster[4]; /* 0x2C: Root directory cluster */
  Byte_t fsInfo[2]; /* 0x30: FSInfo sector */
  Byte_t backupBootSector[2]; /* 0x32: Backup boot sector */
  Byte_t reserved[12]; /* 0x34: Reserved */
  Byte_t driveNumber; /* 0x40: Drive number */
  Byte_t reserved1; /* 0x41: Reserved */
  Byte_t bootSignature; /* 0x42: Boot signature (0x29) */
  Byte_t volumeID[4]; /* 0x43: Volume ID */
  Byte_t volumeLabel[11]; /* 0x47: Volume label */
  Byte_t fsType[8]; /* 0x52: Filesystem type */
} FAT32BootSector_t;


/* FAT32 Directory Entry Structure (32 bytes) */
typedef struct __attribute__ ((packed)) FAT32DirEntry_s {
  Byte_t name[11];                  /* 0x00: 8.3 filename */
  Byte_t attr; /* 0x0B: File attributes */
  Byte_t ntReserved; /* 0x0C: Reserved for Windows NT */
  Byte_t createTimeTenth; /* 0x0D: Creation time (tenths of second) */
  Byte_t createTime[2]; /* 0x0E: Creation time */
  Byte_t createDate[2]; /* 0x10: Creation date */
  Byte_t lastAccessDate[2]; /* 0x12: Last access date */
  Byte_t firstClusterHigh[2]; /* 0x14: High word of first cluster */
  Byte_t writeTime[2]; /* 0x16: Last write time */
  Byte_t writeDate[2]; /* 0x18: Last write date */
  Byte_t firstClusterLow[2]; /* 0x1A: Low word of first cluster */
  Byte_t fileSize[4]; /* 0x1C: File size */
} FAT32DirEntry_t;


/* FAT32 File Attributes */
#define FAT_ATTR_READ_ONLY 0x01u
#define FAT_ATTR_HIDDEN 0x02u
#define FAT_ATTR_SYSTEM 0x04u
#define FAT_ATTR_VOLUME_ID 0x08u
#define FAT_ATTR_DIRECTORY 0x10u
#define FAT_ATTR_ARCHIVE 0x20u
#define FAT_ATTR_LONG_NAME 0x0Fu


/* FAT32 Cluster Markers */
#define FAT32_EOC_MIN 0x0FFFFFF8u /* End of cluster chain (minimum) */
#define FAT32_EOC_MAX 0x0FFFFFFFu /* End of cluster chain (maximum) */
#define FAT32_BAD_CLUSTER 0x0FFFFFF7u /* Bad cluster marker */
#define FAT32_FREE_CLUSTER 0x00000000u /* Free cluster */


/* Helper function to read 16-bit little-endian value */
static HalfWord_t __ReadLE16__(const Byte_t *data_) {
  return((HalfWord_t) data_[0] | ((HalfWord_t) data_[1] << 8));
}


/* Helper function to read 32-bit little-endian value */
static Word_t __ReadLE32__(const Byte_t *data_) {
